chris023/orion-waveshare-rotary-dial/archive/knob-probe/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
# Console over the native USB (same /dev/cu.usbmodem2101 the dial uses).
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
